# Append Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePointArray..::..Append Method
ReferencePointArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	ReferencePoint item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As ReferencePoint _
)
```

Visual C++
---
```text
public:
virtual void Append(
	ReferencePoint^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ReferencePoint
# See Also
ReferencePointArray Class
Autodesk.Revit.DB Namespace